src/cf/src/Enums/ТелеграмСпособыЗапросов/ТелеграмСпособыЗапросов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТелеграмСпособыЗапросов</name>
  <enumValues>
    <name>Простой</name>
  </enumValues>
  <enumValues>
    <name>Кодированный</name>
  </enumValues>
  <enumValues>
    <name>Джейсон</name>
  </enumValues>
  <enumValues>
    <name>Мультипарт</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Enums/ТелеграмСпособыЗапросов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПодобратьСпособЗапроса(Метод, СтруктураПараметров) Экспорт
	
	СпособыЗапросов = Перечисления.ТелеграмСпособыЗапросов;
	
	Если СтруктураПараметров.Свойство("ВходнойФайлСтруктура") = Истина
		И (
		СтруктураПараметров.ВходнойФайлСтруктура.ВидИсточника = "Файл"
		Или СтруктураПараметров.ВходнойФайлСтруктура.ВидИсточника = "АдресВХранилище"
		Или СтруктураПараметров.ВходнойФайлСтруктура.ВидИсточника = "ДвоичныеДанные") Тогда // Есть ещё СерверТелеграм
		
		ПодобранныйСпособ = СпособыЗапросов.Мультипарт;
		
	Иначе
		// Способ по умолчанию
		ПодобранныйСпособ = СпособыЗапросов.Джейсон;
		
		СпособыЗапросовПростой = 
		"getUpdates
		|setWebhook
		|deleteWebhook
		|getWebhookInfo
		|getMe";
		
		СпособыЗапросовКодированный =
		"";
		
		СпособыЗапросовДжейсон = 
		"sendMessage
		|sendPhoto
		|sendAudio
		|sendDocument
		|sendSticker
		|sendVideo
		|sendVoice
		|sendLocation
		|sendVenue
		|sendContact
		|editMessageReplyMarkup";
		
		СпособыЗапросовМультипарт = 
		"setWebhook
		|sendPhoto
		|sendAudio
		|sendDocument
		|sendSticker
		|sendVideo
		|sendVoice";
		
		Если СтрНайти(СпособыЗапросовПростой, Метод + Символы.ПС) > 0 Тогда
			ПодобранныйСпособ = СпособыЗапросов.Простой;
		ИначеЕсли СтрНайти(СпособыЗапросовКодированный, Метод + Символы.ПС) > 0 Тогда
			ПодобранныйСпособ = СпособыЗапросов.Кодированный;
		ИначеЕсли СтрНайти(СпособыЗапросовДжейсон, Метод + Символы.ПС) > 0 Тогда
			ПодобранныйСпособ = СпособыЗапросов.Джейсон;
		ИначеЕсли СтрНайти(СпособыЗапросовМультипарт, Метод + Символы.ПС) > 0 Тогда
			ПодобранныйСпособ = СпособыЗапросов.Мультипарт;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ПодобранныйСпособ;
	
КонецФункции

Функция ТипСодержимого(СпособЗапроса) Экспорт
	
	Ответ = "";
	СпособыЗапроса = Перечисления.ТелеграмСпособыЗапросов;
	Если СпособЗапроса = СпособыЗапроса.Простой Тогда
		Ответ = "";
	ИначеЕсли СпособЗапроса = СпособыЗапроса.Кодированный Тогда
		Ответ = "application/x-www-form-urlencoded";
	ИначеЕсли СпособЗапроса = СпособыЗапроса.Джейсон Тогда
		Ответ = "application/json; charset=utf-8";
	ИначеЕсли СпособЗапроса = СпособыЗапроса.Мультипарт Тогда
		Разделитель = Строка(Новый УникальныйИдентификатор);
		Ответ = "multipart/form-data; boundary=" + Разделитель;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#КонецЕсли
